// Пример 1: Округление числа
// Задание:
// Используйте метод Math.round(), чтобы округлить число 4.7 до ближайшего целого числа и выведите результат.



// Пример 2: Генерация случайного числа
// Задание:
// Используйте метод Math.random(), чтобы сгенерировать случайное число от 0 до 1 (не включая 1) и выведите результат.



// Пример 3: Возведение в степень
// Задание:
// Используйте метод Math.pow(), чтобы возвести число 3 в степень 4 и выведите результат.


// Пример 4: Нахождение максимального и минимального значений
// Задание:
// Используйте методы Math.max() и Math.min(), чтобы найти максимальное и минимальное значения в наборе чисел 5, 12, -3, 8, 0 и выведите результаты.



// Пример 5: Извлечение квадратного корня
// Задание:
// Используйте метод Math.sqrt(), чтобы найти квадратный корень числа 64 и выведите результат.